modm-ext/data.modm.io/docs/svd/header_stm32u3c5xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HSP1</name>
      <description>HSP</description>
      <baseAddress>0x4002c000</baseAddress>
      <interrupt>
        <name>HSP1</name>
        <description>HSP1 global interrupt</description>
        <value>77</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>HSP control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOOTEN</name>
              <description>BOOTEN (Boot Enable control)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLCGDIS</name>
              <description>CTRLCGDIS (HSP_CTRL clock gating disable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMCCGDIS</name>
              <description>MMCCGDIS (MMC clock gating disable)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPECGDIS</name>
              <description>SPECGDIS (SPE clock gating disable)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCMDEVEN</name>
              <description>DCMDEVEN (Direct command event enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDRLCK</name>
              <description>CDRLCK[1:0] bits (CRAM &amp; DRAM lock access control)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>REGLCK</name>
              <description>REGLCK (Register write lock access control)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTREQ</name>
              <description>RSTREQ (Reset request)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTOK</name>
              <description>RSTOK (Reset request accepted)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BARB</name>
              <description>BARB[1:0] bits (BRAM Arbitration)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BSTAT</name>
              <description>BSTAT[3:0] bits (Boot status)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2HSEMR</name>
          <description>HSP CPU to HSP semaphore register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>C2HSEM</name>
              <description>C2HSEM (CPU to HSP semaphore)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2HMSGDR</name>
          <description>HSP CPU to HSP message data register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>C2HDATA</name>
              <description>C2HDATA[31:0] bits (CPU Message for the HSP)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>H2CSEMR</name>
          <description>HSP HSP to CPU semaphore register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>H2CSEM</name>
              <description>H2CSEM (HSP to CPU semaphore)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>H2CMSGDR</name>
          <description>HSP HSP to CPU message data register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>H2CDATA</name>
              <description>H2CDATA[31:0] bits (HSP Message for the CPU)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMDSR</name>
          <description>HSP DCMD Command status register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DCBSY</name>
              <description>DCBSY (Direct command busy flag)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMDPTSR</name>
          <description>HSP DCMD Pointer status register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTRF0</name>
              <description>PTRF0 (Address pointer 0 flag)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTRF1</name>
              <description>PTRF1 (Address pointer 1 flag)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTRF2</name>
              <description>PTRF2 (Address pointer 2 flag)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDOG</name>
              <description>RDOG (Read on-going indicator)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMDIDR</name>
          <description>HSP DCMD Command ID register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMDID</name>
              <description>CMDID[15:0] bits (Command ID)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMDPTR0</name>
          <description>HSP DCMD address pointer register 0</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTCPU</name>
              <description>PTCPU[31:0] bits (Address pointer value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMDPTR1</name>
          <description>HSP DCMD address pointer register 1</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTCPU</name>
              <description>PTCPU[31:0] bits (Address pointer value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMDPTR2</name>
          <description>HSP DCMD address pointer register 2</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTCPU</name>
              <description>PTCPU[31:0] bits (Address pointer value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTENR</name>
          <description>HSP event enable register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVTEN</name>
              <description>EVTEN[21:0] bits (Events enable)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESYNCENR</name>
          <description>HSP Event synchronization enable register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVTSYNCEN</name>
              <description>EVTSYNCEN[21:0] bits (Event synchronization enable)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
            <field>
              <name>CDEGSYNCEN</name>
              <description>CDEGSYNCEN (CPU dedicated event synchronization enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESYNC0SRCR</name>
          <description>HSP Event synchronization source register 0</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EV1SSRC</name>
              <description>EV1SSRC[1:0] bits (Event 1 synchronization source)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV2SSRC</name>
              <description>EV2SSRC[1:0] bits (Event 2 synchronization source)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV3SSRC</name>
              <description>EV3SSRC[1:0] bits (Event 3 synchronization source)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV4SSRC</name>
              <description>EV4SSRC[1:0] bits (Event 4 synchronization source)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV5SSRC</name>
              <description>EV5SSRC[1:0] bits (Event 5 synchronization source)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV6SSRC</name>
              <description>EV6SSRC[1:0] bits (Event 6 synchronization source)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV7SSRC</name>
              <description>EV7SSRC[1:0] bits (Event 7 synchronization source)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV8SSRC</name>
              <description>EV8SSRC[1:0] bits (Event 8 synchronization source)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESYNC1SRCR</name>
          <description>HSP Event synchronization source register 1</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EV9SSRC</name>
              <description>EV9SSRC[1:0] bits (Event 9 synchronization source)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV10SSRC</name>
              <description>EV10SSRC[1:0] bits (Event 10 synchronization source)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV11SSRC</name>
              <description>EV11SSRC[1:0] bits (Event 11 synchronization source)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV12SSRC</name>
              <description>EV12SSRC[1:0] bits (Event 12 synchronization source)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV13SSRC</name>
              <description>EV13SSRC[1:0] bits (Event 13 synchronization source)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV14SSRC</name>
              <description>EV14SSRC[1:0] bits (Event 14 synchronization source)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV15SSRC</name>
              <description>EV15SSRC[1:0] bits (Event 15 synchronization source)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV16SSRC</name>
              <description>EV16SSRC[1:0] bits (Event 16 synchronization source)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESYNC2SRCR</name>
          <description>HSP Event synchronization source register 2</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EV17SSRC</name>
              <description>EV17SSRC[1:0] bits (Event 17 synchronization source)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV18SSRC</name>
              <description>EV18SSRC[1:0] bits (Event 18 synchronization source)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV19SSRC</name>
              <description>EV19SSRC[1:0] bits (Event 19 synchronization source)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV20SSRC</name>
              <description>EV20SSRC[1:0] bits (Event 20 synchronization source)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV21SSRC</name>
              <description>EV21SSRC[1:0] bits (Event 21 synchronization source)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EV22SSRC</name>
              <description>EV22SSRC[1:0] bits (Event 22 synchronization source)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CDEGSSRC</name>
              <description>CDEGSSRC[1:0] bits (CPU dedicated event synchronization source)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEVTLR</name>
          <description>HSP pending event level register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVTL</name>
              <description>EVTL[27:0] bits (Event level)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITFENR</name>
          <description>HSP interfaces enable register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STREAMEN</name>
              <description>STREAMEN (STREAMITF enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGOEN</name>
              <description>TRGOEN (TRGO enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI0EN</name>
              <description>TRGI0EN (TRGIN0 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI1EN</name>
              <description>TRGI1EN (TRGIN1 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI2EN</name>
              <description>TRGI2EN (TRGIN2 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI3EN</name>
              <description>TRGI3EN (TRGIN3 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI4EN</name>
              <description>TRGI4EN (TRGIN4 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI5EN</name>
              <description>TRGI5EN (TRGIN5 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI6EN</name>
              <description>TRGI6EN (TRGIN6 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI7EN</name>
              <description>TRGI7EN (TRGIN7 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI8EN</name>
              <description>TRGI8EN (TRGIN8 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGI9EN</name>
              <description>TRGI9EN (TRGIN9 enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCMDDIS</name>
              <description>DCMDDIS (Direct command interface disable bit )</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSEGEN</name>
              <description>CSEGEN (CSEG interface enable bit &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDEGEN</name>
              <description>CDEGEN (CDEG interface enable bit )</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEGEN</name>
              <description>HSEGEN (HSEG interface enable bit )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGEN</name>
              <description>HDEGEN (HDEG interface enable bit )</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTSRC0R</name>
          <description>HSP Event source register 0</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVT1SRC</name>
              <description>EVT1SRC[2:0] bits (Event source selection for priority encoder input 1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT2SRC</name>
              <description>EVT2SRC[2:0] bits (Event source selection for priority encoder input 2)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT3SRC</name>
              <description>EVT3SRC[2:0] bits (Event source selection for priority encoder input 3)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT4SRC</name>
              <description>EVT4SRC[2:0] bits (Event source selection for priority encoder input 4)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT5SRC</name>
              <description>EVT5SRC[2:0] bits (Event source selection for priority encoder input 5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT6SRC</name>
              <description>EVT6SRC[2:0] bits (Event source selection for priority encoder input 6)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT7SRC</name>
              <description>EVT7SRC[2:0] bits (Event source selection for priority encoder input 7)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT8SRC</name>
              <description>EVT8SRC[2:0] bits (Event source selection for priority encoder input 8)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
