modm-ext/data.modm.io/docs/svd/header_stm32u3c5xx.svd
        <register>
          <name>BKOCFGR2</name>
          <description>HSP break output configuration register 0-3</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCEREN</name>
              <description>ACCEREN (Access error break enable for ACCERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUEREN</name>
              <description>FPUEREN (FPU error break enable for FPUERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCEREN</name>
              <description>OPCEREN (Opcode error break enable for OPCOERRF )</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT28EN</name>
              <description>PFCT28EN (Processing function flag break enable for PFCTF[28] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT29EN</name>
              <description>PFCT29EN (Processing function flag break enable for PFCTF[29] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT30EN</name>
              <description>PFCT30EN (Processing function flag break enable for PFCTF[30] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT31EN</name>
              <description>PFCT31EN (Processing function flag break enable for PFCTF[31] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWEREN</name>
              <description>FWEREN (Firmware error break enable for FWERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVEN</name>
              <description>HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKOCFGR3</name>
          <description>HSP break output configuration register 0-3</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCEREN</name>
              <description>ACCEREN (Access error break enable for ACCERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUEREN</name>
              <description>FPUEREN (FPU error break enable for FPUERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCEREN</name>
              <description>OPCEREN (Opcode error break enable for OPCOERRF )</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT28EN</name>
              <description>PFCT28EN (Processing function flag break enable for PFCTF[28] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT29EN</name>
              <description>PFCT29EN (Processing function flag break enable for PFCTF[29] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT30EN</name>
              <description>PFCT30EN (Processing function flag break enable for PFCTF[30] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT31EN</name>
              <description>PFCT31EN (Processing function flag break enable for PFCTF[31] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWEREN</name>
              <description>FWEREN (Firmware error break enable for FWERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVEN</name>
              <description>HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKICFGR</name>
          <description>HSP break input configuration register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCEREN</name>
              <description>ACCEREN (Access error break enable for ACCERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUEREN</name>
              <description>FPUEREN (FPU error break enable for FPUERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCEREN</name>
              <description>OPCEREN (Opcode error break enable for OPCOERRF )</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT28EN</name>
              <description>PFCT28EN (Processing function flag break enable for PFCTF[28] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT29EN</name>
              <description>PFCT29EN (Processing function flag break enable for PFCTF[29] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT30EN</name>
              <description>PFCT30EN (Processing function flag break enable for PFCTF[30] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT31EN</name>
              <description>PFCT31EN (Processing function flag break enable for PFCTF[31] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWEREN</name>
              <description>FWEREN (Firmware error break enable for FWERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVEN</name>
              <description>HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSATEN</name>
              <description>FSATEN (FPU saturation break enable for FPUSATF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSEN</name>
              <description>SSEN (Single step enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FWERR</name>
          <description>HSP firmware error register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FWERRN</name>
              <description>FWERRN[9:0] bits (Firmware error number)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR0</name>
          <description>HSP parameter register 0</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR1</name>
          <description>HSP parameter register 1</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR2</name>
          <description>HSP parameter register 2</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR3</name>
          <description>HSP parameter register 3</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR4</name>
          <description>HSP parameter register 4</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR5</name>
          <description>HSP parameter register 5</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR6</name>
          <description>HSP parameter register 6</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR7</name>
          <description>HSP parameter register 7</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR8</name>
          <description>HSP parameter register 8</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR9</name>
          <description>HSP parameter register 9</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR10</name>
          <description>HSP parameter register 10</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR11</name>
          <description>HSP parameter register 11</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR12</name>
          <description>HSP parameter register 12</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR13</name>
          <description>HSP parameter register 13</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR14</name>
          <description>HSP parameter register 14</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAMR15</name>
          <description>HSP parameter register 15</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARAM</name>
              <description>PARAM[31:0] bits (Parameter value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPE_IER</name>
          <description>HSP SPE interrupt enable register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>C2HMRDYIE</name>
              <description>C2HMRDYIE (CPU to SPE message ready interrupt enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>H2CMFREEIE</name>
              <description>H2CMFREEIE (SPE to CPU message free interrupt enable)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPE_ISR</name>
          <description>HSP SPE interrupt status register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>C2HMRDYF</name>
              <description>C2HMRDYF (CPU to SPE message box status)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>H2CMFREEF</name>
              <description>H2CMFREEF (SPE to CPU message box status)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTREQF</name>
              <description>RSTREQF (HSP reset request)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUF0EVTF</name>
              <description>BUF0EVTF (BUF0 status)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUF1EVTF</name>
              <description>BUF1EVTF (BUF1 status)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUF2EVTF</name>
              <description>BUF2EVTF (BUF2 status)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUF3EVTF</name>
              <description>BUF3EVTF (BUF3 status)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TCUCFGR</name>
          <description>HSP task comparator unit register</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSKCMP0</name>
              <description>TSKCMP0[5:0] bits (Task compare 0 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TC0EN</name>
              <description>TC0EN (Task comparator 0 enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSKCMP1</name>
              <description>TSKCMP1[5:0] bits (Task compare 1 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TC1EN</name>
              <description>TC1EN (Task comparator 1 enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSKCMP2</name>
              <description>TSKCMP2[5:0] bits (Task compare 2 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TC2EN</name>
              <description>TC2EN (Task comparator 2 enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSKCMP3</name>
              <description>TSKCMP3[5:0] bits (Task compare 3 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TC3EN</name>
              <description>TC3EN (Task comparator 3 enable )</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TOVLPCR</name>
          <description>HSP task overlap control register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOVLPEN</name>
              <description>TOVLPEN (Task overlap enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LTNB</name>
              <description>LTNB[5:0] bits (Lower task number value &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>HTNB</name>
              <description>HTNB[5:0] bits (Higher task number value )</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SNPR</name>
          <description>HSP snoop register</description>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SNPSELA</name>
              <description>SNPSELA[2:0] bits (Snoop group A signal selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SNPSELB</name>
              <description>SNPSELB[2:0] bits (Snoop group B signal selection)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNTR</name>
          <description>HSP conflict counter register</description>
          <addressOffset>0x37c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CCNTR</name>
              <description>CCNTR[31:0] bits (Conflict counter)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
