modm-ext/data.modm.io/docs/svd/header_stm32u3c5xx.svd
        <register>
          <name>ERRINFR</name>
          <description>HSP error information register</description>
          <addressOffset>0x3b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEXACT</name>
              <description>INEXACT (INEXACT exception flag)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDFLOW</name>
              <description>UDFLOW (UNDERFLOW exception flag)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFLOW</name>
              <description>OVFLOW (OVERFLOW exception flag)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVZERO</name>
              <description>DIVZERO (Division by zero exception flag)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVALID</name>
              <description>INVALID (INVALID exception flag)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DENORM</name>
              <description>DENORM (DENORMAL exception flag)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMERR</name>
              <description>CMERR (Code memory access error flag)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERR</name>
              <description>DMERR (Data memory access error flag)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MAHBERR</name>
              <description>MAHBERR (Internal AHB access error flag)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAHBERR</name>
              <description>SAHBERR (Slave AHB access error flag)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGIERR</name>
              <description>TRGIERR[9:0] bits (TRGIN error information)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ICR</name>
          <description>HSP error interrupt clear register</description>
          <addressOffset>0x3b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRGIOVRC</name>
              <description>TRGIOVRC (Clear TRGIOVRF flag)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B0ERRC</name>
              <description>B0ERRC (Clear B0ERRF flag)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1ERRC</name>
              <description>B1ERRC (Clear B1ERRF flag)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2ERRC</name>
              <description>B2ERRC (Clear B2ERRF flag)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3ERRC</name>
              <description>B3ERRC (Clear B3ERRF flag)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPOVRC</name>
              <description>CAPOVRC (Clear CAPOVRF flag)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWERRC</name>
              <description>FWERRC (Clear FWERRF flag)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCHERRC</name>
              <description>SCHERRC (Clear SCHERRF flag)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKINC</name>
              <description>BKINC (Clear BKINF flag)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVRC</name>
              <description>HDEGOVRC (Clear HDEGOVRF flag)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCOERRC</name>
              <description>OPCOERRC (Clear OPCOERRF flag)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCERRC</name>
              <description>ACCERRC (Clear ACCERRF flag)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUERRC</name>
              <description>FPUERRC (Clear FPUERRF flag)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ICR</name>
          <description>HSP events Interrupt clear register</description>
          <addressOffset>0x3b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>H2CMRDYC</name>
              <description>H2CMRDYC (Clear H2CMRDYF flag)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2HMFREEC</name>
              <description>C2HMFREEC (Clear C2HMFREEF flag)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCDONEC</name>
              <description>DCDONEC (Clear DCDONEF flag)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDEGRDYC</name>
              <description>CDEGRDYC (Clear of CDEGRDYF flag)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFWFEC</name>
              <description>SOFWFEC (Clear of SOFWFEF flag)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOFWFEC</name>
              <description>EOFWFEC (Clear of EOFWFEF flag)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP0C</name>
              <description>SOTECP0C (Clear SOTECP0F flag)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP1C</name>
              <description>SOTECP1C (Clear SOTECP1F flag)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP2C</name>
              <description>SOTECP2C (Clear SOTECP2F flag)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP3C</name>
              <description>SOTECP3C (Clear SOTECP3F flag)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP0C</name>
              <description>EOTECP0C (Clear EOTECP0F flag)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP1C</name>
              <description>EOTECP1C (Clear EOTECP1F flag)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP2C</name>
              <description>EOTECP2C (Clear EOTECP2F flag)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP3C</name>
              <description>EOTECP3C (Clear EOTECP3F flag)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOVLPC</name>
              <description>TOVLPC (Clear TOVLPF flag)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUSATC</name>
              <description>FPUSATC (Clear FPUSATF flag)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCTEVT_ICR</name>
          <description>HSP processing event interrupt clear register</description>
          <addressOffset>0x3bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PFCTC</name>
              <description>PFCTC[31:0] bits (Clear PFCTF[31:0] flag)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FWVERR</name>
          <description>HSP firmware versions register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CRAMINREV</name>
              <description>CRAMINREV[7:0] bits (Code RAM Minor revision)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CRAMAJREV</name>
              <description>CRAMAJREV[3:0] bits (Code RAM Major revision)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CROMINREV</name>
              <description>CROMINREV[7:0] bits (Code ROM Minor revision)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CROMAJREV</name>
              <description>CROMAJREV[3:0] bits (Code ROM Major revision)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DROMINREV</name>
              <description>DROMINREV[3:0] bits (Data ROM Minor revision)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DROMAJREV</name>
              <description>DROMAJREV[3:0] bits (Data ROM Major revision)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
