modm-ext/data.modm.io/docs/svd/header_stm32u3c5xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <baseAddress>0x40030800</baseAddress>
      <interrupt>
        <name>PWR</name>
        <description>PWR non-secure interrupt</description>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>PWR_S</name>
        <description>PWR secure interrupt</description>
        <value>124</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPMS</name>
              <description>LPMS[2:0] Low-power mode selection field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP0</name>
                  <description>Stop 0 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP1</name>
                  <description>Stop 1 mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP2</name>
                  <description>Stop 2 mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP3</name>
                  <description>Stop 3 mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Standby mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Shutdown mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB1</name>
              <description>SRAM2 page 1 Retention in Standby</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRSB2</name>
              <description>SRAM2 page 2 Retention in Standby</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRSB3</name>
              <description>SRAM2 page 3 Retention in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULPMEN</name>
              <description>BOR ultra-low power mode in Standby/Shutdown</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PD</name>
              <description>SRAM1 (192 KB) power-down in Run mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PD</name>
              <description>SRAM2 (64 KB) power-down in Run mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PD</name>
              <description>SRAM3 (320 KB) power-down in Run mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4PD</name>
              <description>SRAM4 (64 KB) power-down in Run mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM1PDS1</name>
              <description>SRAM1 page 1 (16 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS2</name>
              <description>SRAM1 page 2 (16 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS3</name>
              <description>SRAM1 page 3 (32 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS4</name>
              <description>SRAM1 page 4 (32 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS5</name>
              <description>SRAM1 page 5 (32 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS6</name>
              <description>SRAM1 page 6 (32 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS7</name>
              <description>SRAM1 page 7 (32 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS1</name>
              <description>SRAM3 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS2</name>
              <description>SRAM3 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS3</name>
              <description>SRAM3 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS4</name>
              <description>SRAM3 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS5</name>
              <description>SRAM3 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PDS1</name>
              <description>SRAM2 page 1 (8 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PDS2</name>
              <description>SRAM2 page 2 (24 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PDS3</name>
              <description>SRAM2 page 3 (32 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4PDS</name>
              <description>SRAM4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICRAMPDS</name>
              <description>ICACHE SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RETENTION</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETENTION</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAMPDS</name>
              <description>FDCAN and USB peripherals SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RETENTION</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETENTION</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKARAMPDS</name>
              <description>PKA32 SRAM power-down in Stop modes (Stop 0, 1)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RETENTION</name>
                  <description>PKA SRAM no retention in Stop modes (Stop 0, 1, 2, 3)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETENTION</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMFWU</name>
              <description>SRAM fast wakeup from Stop modes (Stop 0, 1)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHFWU</name>
              <description>Flash memory fast wakeup from Stop modes (Stop 0, 1)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>Power control register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGSEL</name>
              <description>Regulator selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_SUPPLY</name>
                  <description>LDO regulator supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPS_SUPPLY</name>
                  <description>SMPS regulator supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSTEN</name>
              <description>Fast soft start</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VOSR</name>
          <description>Power voltage scaling register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>R1EN</name>
              <description>Voltage scaling range 1 selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>R2EN</name>
              <description>Voltage scaling range 2 selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOSTEN</name>
              <description>EPOD booster enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>R1RDY</name>
              <description>Ready bit for Vcore range 1 selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>R2RDY</name>
              <description>Ready bit for Vcore range 2 selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOSTRDY</name>
              <description>EPOD booster ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SVMCR</name>
          <description>Power supply voltage monitoring control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PVDE</name>
              <description>Programmable voltage detector enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDLS</name>
              <description>PVDLS[2:0] Programmable voltage detector level selection field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PVDLEVEL_0</name>
                  <description>Voltage threshold detected by PVD 2.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_1</name>
                  <description>Voltage threshold detected by PVD 2.2 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_2</name>
                  <description>Voltage threshold detected by PVD 2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_3</name>
                  <description>Voltage threshold detected by PVD 2.5 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_4</name>
                  <description>Voltage threshold detected by PVD 2.6 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_5</name>
                  <description>Voltage threshold detected by PVD 2.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_6</name>
                  <description>Voltage threshold detected by PVD 2.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_7</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UVMEN</name>
              <description>VDDUSB Independent USB supply voltage monitor enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO2VMEN</name>
              <description>VDDIO2 Independent I/Os voltage monitor enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVM1EN</name>
              <description>VDDA Independent analog supply voltage monitor 1 enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVM2EN</name>
              <description>VDDA Independent analog supply voltage monitor 2 enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USV</name>
              <description>VDDUSB Independent USB supply valid</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO2SV</name>
              <description>VDDIO2 Independent I/Os supply valid</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASV</name>
              <description>VDDA Independent analog supply valid</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WUCR1</name>
          <description>Power wakeup control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WUPEN1</name>
              <description>Wakeup line WKUP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN2</name>
              <description>Wakeup line WKUP2 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN3</name>
              <description>Wakeup line WKUP3 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN4</name>
              <description>Wakeup line WKUP4 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN5</name>
              <description>Wakeup line WKUP5 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN6</name>
              <description>Wakeup line WKUP6 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN7</name>
              <description>Wakeup line WKUP7 enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN8</name>
              <description>Wakeup line WKUP8 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN9</name>
              <description>Wakeup line WKUP9 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN10</name>
              <description>Wakeup line WKUP10 enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WUCR2</name>
          <description>Power wakeup control register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WUPP1</name>
              <description>Wakeup line WKUP1 polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP2</name>
              <description>Wakeup line WKUP2 polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP3</name>
              <description>Wakeup line WKUP3 polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP4</name>
              <description>Wakeup line WKUP4 polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP5</name>
              <description>Wakeup line WKUP5 polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP6</name>
              <description>Wakeup line WKUP6 polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP7</name>
              <description>Wakeup line WKUP7 polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPP8</name>
              <description>Wakeup line WKUP8 polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
