modm-ext/data.modm.io/docs/svd/header_stm32u3c5xx.svd
        <register>
          <name>JDR1</name>
          <description>ADC injected data register 1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 1 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>ADC injected data register 2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 2 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>ADC injected data register 3</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 3 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>ADC injected data register 4</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 4 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <description>ADC analog watchdog 2 configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD2CH</name>
              <description>ADC analog watchdog 2 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <description>ADC analog watchdog 3 configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD3CH</name>
              <description>ADC analog watchdog 3 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD1LTR</name>
          <description>ADC analog watchdog 1 low threshold register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTR</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD1HTR</name>
          <description>ADC analog watchdog 1 high threshold register</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HTR</name>
              <description>ADC analog watchdog 1 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
            <field>
              <name>AWDFILT</name>
              <description>ADC analog watchdog 1 filtering</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2LTR</name>
          <description>ADC analog watchdog 2 low threshold register</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTR</name>
              <description>ADC analog watchdog 2 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2HTR</name>
          <description>ADC analog watchdog 2 high threshold register</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HTR</name>
              <description>ADC analog watchdog 2 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3LTR</name>
          <description>ADC analog watchdog 3 low threshold register</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTR</name>
              <description>ADC analog watchdog 3 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3HTR</name>
          <description>ADC analog watchdog 3 high threshold register</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HTR</name>
              <description>ADC analog watchdog 3 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC calibration factors</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALFACT</name>
              <description>ADC calibration factor in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <description>ADC option register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VDDCOREEN</name>
              <description>ADC internal path to VDDCORE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
